[
    {
        "id": 1,
        "review": "Before partnering with MasterMind Web Developers, we had a simple static website that wasn't bringing patients. Their team redesigned our site, optimized it for SEO, and set up Google Ads campaigns. Within 3 months, our patient inquiries for dental implants and RCT doubled. Today, 40% of our new patients come through online leads generated by their work.",
        "name": "Dr. Nikhil Abbad",
        "designation": "Abbad Dental Clinic",
        "thumb": "abbad.jpg"
    },
    {
        "id": 2,
        "review": "We struggled with visibility in Bengaluru's competitive dental market. MasterMind not only built a modern, mobile-friendly website but also worked on GBP SEO and content marketing. As a result, we started ranking for 'dentist near me' and 'dental implants in HSR'. Now, we receive consistent appointment bookings from Google searches every week.",
        "name": "Dr. Souphia Saud",
        "designation": "Kosmix Dental Clinic",
        "thumb": "kosmix.png"
    },
    {
        "id": 3,
        "review": "Coconut Beach Farm Resort was getting most bookings offline, and weekends were often underbooked. MasterMind Web Developers created a stunning website with booking integrations and ran targeted Facebook & Instagram ads in Pune and Mumbai. Within 2 months, our weekend bookings increased by 60%, and we now get a steady stream of online inquiries every day.",
        "name": "Ramesh Deshmukh",
        "designation": "Coconut Beach Farm Resort",
        "thumb": "coconutbeach.png"
    },
    {
        "id": 4,
        "review": "We wanted to stand out in Ahmedabad's food space and attract more walk-ins. MasterMind Web Developers handled our social media campaigns and optimized our Google Business Profile. Within weeks, our restaurant started appearing in the top results for 'Punjabi restaurant in Ahmedabad' and 'best parathas near me'. Footfall and online inquiries grew by 45%, and our Instagram following doubled. Their strategies brought us both visibility and loyal customers.",
        "name": "Team Jassi De Parathe",
        "designation": "Ahmedabad",
        "thumb": "jassideparathe.jpeg"
    },
    {
        "id": 5,
        "review": "Starting a travel company was a dream, and MasterMind Web Developers helped us shape it from scratch. From designing our logo and brand identity to developing a professional website and social media presence, they managed everything seamlessly. Today, Saarthi Tours & Travels is recognized as a trusted name in Nashik. We're consistently getting tour inquiries online, and clients appreciate our professional brand image. Their complete branding package gave us the perfect launchpad for growth.",
        "name": "Prathamesh Chaudhari",
        "designation": "Founder – Saarthi Tours & Travels, Nashik",
        "thumb": "sarthi.jpeg"
    },
    {
        "id": 6,
        "review": "Borivali has many dental clinics, and standing out was a challenge. MasterMind Web Developers created engaging social media content and optimized our local SEO. As a result, Smile Solutions started ranking higher for 'dentist in Borivali West' and related searches. We've seen a sharp increase in patient inquiries, especially for dental implants and cosmetic treatments. Their digital marketing expertise not only boosted our visibility but also built trust with patients online.",
        "name": "Dr. Heeral Chikhal",
        "designation": "Smile Solutions Advanced Dental Care & Implant Centre",
        "thumb": "smilesolutions.jpg"
    },
        {
        "id": 7,
        "review": "We were getting very few online appointments before working with MasterMind. Their team set up and managed highly targeted Google Ads campaigns for our clinic. Within just 2 months, our inquiries for RCT and dental implants more than doubled. Today, over 60% of our new patient flow comes directly through Google Ads leads, giving us consistent growth every month.",
        "name": "Dr. Jalpa Tank",
        "designation": "HSR Dental Booth",
        "thumb": "hsr.png"
    },
            {
        "id": 8,
        "review": "Earlier, most of our interior design projects came only through referrals, and we lacked a steady online lead flow. MasterMind Web Developers ran targeted Instagram ad campaigns, one specifically for Bengaluru and another broader campaign covering Karnataka, Goa, Andhra Pradesh, and Maharashtra. Within just 6 weeks, we started receiving a consistent stream of quality leads, and today over 80% of our new projects come directly through Instagram campaigns managed by their team.",
        "name": "The White Walls Interiors, Bangalore",
        "thumb": "whitewalls.jpg"
    },
                {
        "id": 9,
        "review": "Being a new dental clinic, our biggest challenge was building visibility and attracting patients in a competitive area like Khar West. We partnered with MasterMind Web Developers right from the start in March 2025. Their team worked on strengthening our digital presence through local SEO and launched targeted Google Ads campaigns. Within the first 2 months, we started ranking locally for key treatments and began receiving steady inquiries from ads. Today, despite being a new setup, we are already seeing consistent patient flow and strong brand visibility in our locality, thanks to their strategic digital marketing.",
        "name": "Dr. Sailee Kalyankar",
        "designation": "Symphony Dental Care, Khar West",
        "thumb": "symphony.png"
    },
                    {
        "id": 10,
        "review": "As a growing homeopathic clinic, we wanted to reach more patients in Pune who were actively searching for holistic treatments online. MasterMind Web Developers helped us build a strong digital presence through local SEO, optimized our Google Business Profile, and ran targeted campaigns to highlight our specialties. Within a few months, we started ranking for key searches like 'homeopathic doctor in Pune' and saw a steady rise in appointment bookings. Their strategic approach has helped us gain both visibility and trust among patients seeking natural and effective treatments.",
        "name": "Dr. Kiran S Patil",
        "designation": "Shree Datta Seva Homeopathic Clinic, Pune",
        "thumb": "shreedatta.jpeg"
    }
]
